In [2]:
%load_ext sql

In [3]:
%sql sqlite:///CARS.db

In [4]:
%sql CREATE TABLE cars(VIN VARCHAR(40), Manufacturer VARCHAR(20), Model VARCHAR(40), Year TINYINT(4),color CHAR(10))

 * sqlite:///CARS.db
(sqlite3.OperationalError) table cars already exists
[SQL: CREATE TABLE cars(VIN VARCHAR(40), Manufacturer VARCHAR(20), Model VARCHAR(40), Year TINYINT(4),color CHAR(10))]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [5]:
%sql CREATE TABLE Custumers(Custumer_id CHAR(6), Name VARCHAR(40), Phone VARCHAR(20), Email VARCHAR(40),Address VARCHAR(60), City VARCHAR(20), State VARCHAR (20), Country VARCHAR (20), ZIP VARCHAR(10))

 * sqlite:///CARS.db
(sqlite3.OperationalError) table Custumers already exists
[SQL: CREATE TABLE Custumers(Custumer_id CHAR(6), Name VARCHAR(40), Phone VARCHAR(20), Email VARCHAR(40),Address VARCHAR(60), City VARCHAR(20), State VARCHAR (20), Country VARCHAR (20), ZIP VARCHAR(10))]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [6]:
%sql CREATE TABLE Salespersons(Staff_id VARCHAR(20), Name VARCHAR(40), Store VARCHAR(20))

 * sqlite:///CARS.db
(sqlite3.OperationalError) table Salespersons already exists
[SQL: CREATE TABLE Salespersons(Staff_id VARCHAR(20), Name VARCHAR(40), Store VARCHAR(20))]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [7]:
%sql CREATE TABLE Invoices(Invoice_nu CHAR(10), Date DATETIME(15),VIN VARCHAR(40), Name VARCHAR(40) ,Staff_id VARCHAR(20))

 * sqlite:///CARS.db
(sqlite3.OperationalError) table Invoices already exists
[SQL: CREATE TABLE Invoices(Invoice_nu CHAR(10), Date DATETIME(15),VIN VARCHAR(40), Name VARCHAR(40) ,Staff_id VARCHAR(20))]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [11]:
%sql SHOW Custumers;

 * sqlite:///CARS.db
(sqlite3.OperationalError) near "SHOW": syntax error
[SQL: SHOW Custumers;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [13]:
%%sql
SELECT name FROM sqlite_master
WHERE type='table'
ORDER BY name;

 * sqlite:///CARS.db
Done.

[('CUSTUMERS',), ('Invoices',), ('Salespersons',), ('cars',)]

In [15]:
%%sql
SELECT name FROM sqlite_master
WHERE type='CUSTUMERS'
ORDER BY name;

 * sqlite:///CARS.db
Done.

[]

In [18]:
%sql INSERT INTO cars (VIN, Manufacturer, Model, Year, Color) VALUES('3K096I98581DHSNUP','Volkswagen','Tiguan',2019,'Blue');

 * sqlite:///CARS.db
1 rows affected.

[]

In [19]:
%sql INSERT INTO cars (VIN, Manufacturer, Model, Year, Color) VALUES('ZM8G7BEUQZ97IH46V','Peugeot','Rifter',2019,'Red')

 * sqlite:///CARS.db
1 rows affected.

[]

In [20]:
%sql INSERT INTO cars (VIN, Manufacturer, Model, Year, Color) VALUES('HKNDGS7CU31E9Z7JW','Toyota','RAV4',2018,'Silver')

 * sqlite:///CARS.db
1 rows affected.

[]

In [ ]:
%sql INSERT INTO cars (VIN, Manufacturer, Model, Year, Color) VALUES('ZM8G7BEUQZ97IH46V','Peugeot','Rifter',2019,'Red')

In [21]:
%sql INSERT INTO cars (VIN, Manufacturer, Model, Year, Color) VALUES('RKXVNNIHLVVZOUB4M','Ford','Fusion',2018,'White')

 * sqlite:///CARS.db
1 rows affected.

[]

In [22]:
%sql INSERT INTO cars (VIN, Manufacturer, Model, Year, Color) VALUES('HKNDGS7CU31E9Z7JW','Toyota','RAV4',2018,'Silver')

 * sqlite:///CARS.db
1 rows affected.

[]

In [23]:
%sql INSERT INTO cars (VIN, Manufacturer, Model, Year, Color) VALUES('DAM41UDN3CHU2WVF6','Volvo','V60',2019,'Gray')

 * sqlite:///CARS.db
1 rows affected.

[]

In [24]:
%sql INSERT INTO cars (VIN, Manufacturer, Model, Year, Color) VALUES('DAM41UDN3CHU2WVF6A','Volvo','V60 Cross Country',2019,'Gray')

 * sqlite:///CARS.db
1 rows affected.

[]

In [26]:
%sql SELECT * FROM CARS

 * sqlite:///CARS.db
Done.

[('3K096I98581DHSNUP', 'Volkswagen', 'Tiguan', 2019, 'Blue'),
 ('ZM8G7BEUQZ97IH46V', 'Peugeot', 'Rifter', 2019, 'Red'),
 ('HKNDGS7CU31E9Z7JW', 'Toyota', 'RAV4', 2018, 'Silver'),
 ('RKXVNNIHLVVZOUB4M', 'Ford', 'Fusion', 2018, 'White'),
 ('HKNDGS7CU31E9Z7JW', 'Toyota', 'RAV4', 2018, 'Silver'),
 ('DAM41UDN3CHU2WVF6', 'Volvo', 'V60', 2019, 'Gray'),
 ('DAM41UDN3CHU2WVF6A', 'Volvo', 'V60 Cross Country', 2019, 'Gray')]

In [ ]:

ID	Customer ID	Name	Phone	Email	Address	City	State/Province	Country	Postal
0	10001	Pablo Picasso	+34 636 17 63 82	-	Paseo de la Chopera, 14	Madrid	Madrid	Spain	28045
1	20001	Abraham Lincoln	+1 305 907 7086	-	120 SW 8th St	Miami	Florida	United States	33130
2	30001	Napoléon Bonaparte	+33 1 79 75 40 00	-	40 Rue du Colisée	Paris	Île-de-France	France	75008

In [35]:
%%sql
INSERT INTO Custumers (Custumer_id, Name, Phone, Email ,Address , City , State, Country, ZIP) VALUES('10001','Pablo Picasso','+34 636 17 63 82','-','Paseo de la Chopera','14 Madrid','Madrid','Spain',28045)

 * sqlite:///CARS.db
1 rows affected.

[]

In [31]:
%%sql
INSERT INTO Custumers (Custumer_id, Name, Phone, Email ,Address , City , State, Country, ZIP) VALUES('10001','Pablo Picasso','+34 636 17 63 82','-','Paseo de la Chopera','14 Madrid','Madrid','Spain',28045)

 * sqlite:///CARS.db
1 rows affected.

[]

In [32]:
%%sql
INSERT INTO Custumers (Custumer_id, Name, Phone, Email ,Address , City , State, Country, ZIP) VALUES('30001','Napoléon Bonaparte','+33 1 79 75 40 00','-','40 Rue du Colisée','Paris','Île-de-France','France',75008)

 * sqlite:///CARS.db
1 rows affected.

[]

In [36]:
%sql SELECT * FROM Custumers

 * sqlite:///CARS.db
Done.

[('10001', 'Pablo Picasso', '+34 636 17 63 82', 'Paseo de la Chopera', '-', '14 Madrid', 'Madrid', 'Spain', '28045'),
 ('20001', 'Abraham Lincoln', '+1 305 907 7086', '-', '120 SW 8th St', 'Miami', 'Florida', 'United States', '33130'),
 ('30001', 'Napoléon Bonaparte', '+33 1 79 75 40 00', '-', '40 Rue du Colisée', 'Paris', 'Île-de-France', 'France', '75008'),
 ('10001', 'Pablo Picasso', '+34 636 17 63 82', '-', 'Paseo de la Chopera', '14 Madrid', 'Madrid', 'Spain', '28045')]

In [37]:
%sql INSERT INTO Salespersons(Staff_id, Name, Store ) VALUES('00001','Petey Cruiser','Madrid')

 * sqlite:///CARS.db
1 rows affected.

[]

In [38]:
%sql INSERT INTO Salespersons(Staff_id, Name, Store ) VALUES('00002','Anna Sthesia','Barcelona')

 * sqlite:///CARS.db
1 rows affected.

[]

In [39]:
%sql INSERT INTO Salespersons(Staff_id, Name, Store ) VALUES('00003','Paul Molive','Berlin')

 * sqlite:///CARS.db
1 rows affected.

[]

In [40]:
%sql INSERT INTO Salespersons(Staff_id, Name, Store ) VALUES('00004','Gail Forcewind','Paris')

 * sqlite:///CARS.db
1 rows affected.

[]

In [41]:
%sql INSERT INTO Salespersons(Staff_id, Name, Store ) VALUES('00005','Paige Turner','Mimia')

 * sqlite:///CARS.db
1 rows affected.

[]

In [42]:
%sql INSERT INTO Salespersons(Staff_id, Name, Store ) VALUES('00006','Bob Frapples','Mexico City')

 * sqlite:///CARS.db
1 rows affected.

[]

In [43]:
%sql INSERT INTO Salespersons(Staff_id, Name, Store ) VALUES('00007','Walter Melon','Amsterdam')

 * sqlite:///CARS.db
1 rows affected.

[]

In [44]:
%sql INSERT INTO Salespersons(Staff_id, Name, Store ) VALUES('00008','Shonda Leer','São Paulo')

 * sqlite:///CARS.db
1 rows affected.

[]

In [45]:
%sql SELECT * FROM Salespersons

 * sqlite:///CARS.db
Done.

[('00001', 'Petey Cruiser', 'Madrid'),
 ('00002', 'Anna Sthesia', 'Barcelona'),
 ('00003', 'Paul Molive', 'Berlin'),
 ('00004', 'Gail Forcewind', 'Paris'),
 ('00005', 'Paige Turner', 'Mimia'),
 ('00006', 'Bob Frapples', 'Mexico City'),
 ('00007', 'Walter Melon', 'Amsterdam'),
 ('00008', 'Shonda Leer', 'São Paulo')]

In [46]:
%sql INSERT INTO Invoices(Invoice_nu, Date,VIN, Name ,Staff_id ) VALUES('852399038','22-08-2018','0','1','3')

 * sqlite:///CARS.db
1 rows affected.

[]

In [47]:
%sql INSERT INTO Invoices(Invoice_nu, Date,VIN, Name ,Staff_id ) VALUES('731166526','31-12-2018','3','0','5')

 * sqlite:///CARS.db
1 rows affected.

[]

In [48]:
%sql INSERT INTO Invoices(Invoice_nu, Date,VIN, Name ,Staff_id ) VALUES('271135104','22-01-2019','2','2','7')

 * sqlite:///CARS.db
1 rows affected.

[]

In [49]:
%sql SELECT * FROM Invoices

 * sqlite:///CARS.db
Done.

[('852399038', '22-08-2018', '0', '1', '3'),
 ('731166526', '31-12-2018', '3', '0', '5'),
 ('271135104', '22-01-2019', '2', '2', '7')]

In [50]:
## Challenge 3

In [52]:
%sql DROP TABLE Salespersons;

 * sqlite:///CARS.db
Done.

[]

In [55]:
%sql CREATE TABLE Salespersons(Staff_id VARCHAR(20), Name VARCHAR(40), Store VARCHAR(20))

 * sqlite:///CARS.db
Done.

[]

In [56]:
%%sql 
INSERT INTO Salespersons(Staff_id, Name, Store ) VALUES('00001','Petey Cruiser','Madrid');
INSERT INTO Salespersons(Staff_id, Name, Store ) VALUES('00002','Anna Sthesia','Barcelona');
INSERT INTO Salespersons(Staff_id, Name, Store ) VALUES('00003','Paul Molive','Berlin');
INSERT INTO Salespersons(Staff_id, Name, Store ) VALUES('00004','Gail Forcewind','Paris');
INSERT INTO Salespersons(Staff_id, Name, Store ) VALUES('00005','Paige Turner','Miami');
INSERT INTO Salespersons(Staff_id, Name, Store ) VALUES('00006','Bob Frapples','Mexico City');
INSERT INTO Salespersons(Staff_id, Name, Store ) VALUES('00007','Walter Melon','Amsterdam');
INSERT INTO Salespersons(Staff_id, Name, Store ) VALUES('00008','Shonda Leer','São Paulo');

 * sqlite:///CARS.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [60]:
%sql DROP TABLE Custumers;

 * sqlite:///CARS.db
Done.

[]

In [61]:
%sql CREATE TABLE Custumers(Custumer_id CHAR(6), Name VARCHAR(40), Phone VARCHAR(20), Email VARCHAR(40),Address VARCHAR(60), City VARCHAR(20), State VARCHAR (20), Country VARCHAR (20), ZIP VARCHAR(10))

 * sqlite:///CARS.db
Done.

[]

In [62]:
%%sql
INSERT INTO Custumers (Custumer_id, Name, Phone, Email ,Address , City , State, Country, ZIP) VALUES('10001','Pablo Picasso','+34 636 17 63 82','ppicasso@gmail.com','Paseo de la Chopera','14 Madrid','Madrid','Spain',28045);
INSERT INTO Custumers (Custumer_id, Name, Phone, Email ,Address , City , State, Country, ZIP) VALUES('20001','Abraham Lincoln','+1 305 907 7086','lincoln@us.gov','120 SW 8th St','Miami','Florida','United States',33130);
INSERT INTO Custumers (Custumer_id, Name, Phone, Email ,Address , City , State, Country, ZIP) VALUES('30001','Napoléon Bonaparte','+33 1 79 75 40 00','hello@napoleon.me','40 Rue du Colisée','Paris','Île-de-France','France',75008);

 * sqlite:///CARS.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [64]:
%%sql
DELETE from Cars
WHERE VIN = 'DAM41UDN3CHU2WVF6A';

 * sqlite:///CARS.db
1 rows affected.

[]

In [65]:
%sql SELECT * FROM cUSTUMERS

 * sqlite:///CARS.db
Done.

[('10001', 'Pablo Picasso', '+34 636 17 63 82', 'ppicasso@gmail.com', 'Paseo de la Chopera', '14 Madrid', 'Madrid', 'Spain', '28045'),
 ('20001', 'Abraham Lincoln', '+1 305 907 7086', 'lincoln@us.gov', '120 SW 8th St', 'Miami', 'Florida', 'United States', '33130'),
 ('30001', 'Napoléon Bonaparte', '+33 1 79 75 40 00', 'hello@napoleon.me', '40 Rue du Colisée', 'Paris', 'Île-de-France', 'France', '75008')]

In [66]:
%sql SELECT * FROM Salespersons

 * sqlite:///CARS.db
Done.

[('00001', 'Petey Cruiser', 'Madrid'),
 ('00002', 'Anna Sthesia', 'Barcelona'),
 ('00003', 'Paul Molive', 'Berlin'),
 ('00004', 'Gail Forcewind', 'Paris'),
 ('00005', 'Paige Turner', 'Miami'),
 ('00006', 'Bob Frapples', 'Mexico City'),
 ('00007', 'Walter Melon', 'Amsterdam'),
 ('00008', 'Shonda Leer', 'São Paulo')]